const app = getApp()

Page({

  /**
   * 页面的初始数据
   */
  data: {
    StatusBar: app.globalData.StatusBar,
    CustomBar: app.globalData.CustomBar,
    TabCur: 0,
    VerticalNavTop: 0,
    Custom: app.globalData.Custom,

    is_save:false,
    is_complete:false,

    one_class_name :'销售|客服|市场',
    one_class_index:0,
    two_class_name: '销售业务',
    two_class_index:1,
    three_class_name :'请选择',
    three_class_index:0,
    one_click:1,

    checkbox_name_1:'',
    checkbox_code_1: '',
    checkbox_name_2: '',
    checkbox_code_2: '',
    checkbox_name_3: '',
    checkbox_code_3: '',
    checkbox_name_list: [],
    checkbox_list:[],
    is_select:false,
    




    one_class_name_s: '销售|客服|市场',
    one_class_index_s: 0,
    two_class_name_s: '销售业务',
    two_class_index_s: 1,
    three_class_name_s: '请选择',
    three_class_index_s: 0,
    one_click_s: 1,

    checkbox_name_1_s: '',
    checkbox_code_1_s: '',
    checkbox_name_2_s: '',
    checkbox_code_2_s: '',
    checkbox_name_3_s: '',
    checkbox_code_3_s: '',
    checkbox_name_list_s: [],
    checkbox_list_s: [],
    is_select_s: false,



    money_index:6,
    money: ['1000以下', '1000-2000', '2000-4000', '4000-6000', '6000-8000', '8000-10000', '10000-15000', '15000-25000', '25000-35000', '35000-50000', '50000-70000', '70000-100000', '100000以上'],
    xianju: ['广东省', '广州市', '海珠区'],


    job_name_json: [[{ "name": "销售|客服|市场" }, [{ "name": "客服/售前/售后技术支持", "code": 4000000 }, { "name": "客户服务专员/助理", "code": 257 }, { "name": "售前/售后技术支持管理", "code": 258 }, { "name": "客户咨询热线/呼叫中心人员", "code": 260 }, { "name": "客户关系/投诉协调人员", "code": 261 }, { "name": "客户服务经理", "code": 390 }, { "name": "客户服务总监", "code": 391 }, { "name": "售前/售后技术支持工程师", "code": 392 }, { "name": "客户服务主管", "code": 549 }, { "name": "网络/在线客服", "code": 846 }, { "name": "VIP专员", "code": 2147 }, { "name": "呼叫中心客服", "code": 2148 }, { "name": "其他", "code": 262 }], [{ "name": "销售业务", "code": 4010200 }, { "name": "销售代表", "code": 6 }, { "name": "渠道/分销专员", "code": 7 }, { "name": "客户代表", "code": 8 }, { "name": "销售工程师", "code": 9 }, { "name": "医药代表", "code": 10 }, { "name": "电话销售", "code": 11 }, { "name": "团购业务员", "code": 452 }, { "name": "网络/在线销售", "code": 924 }, { "name": "区域销售专员/助理", "code": 925 }, { "name": "大客户销售代表", "code": 926 }, { "name": "销售业务跟单", "code": 927 }, { "name": "业务拓展专员/助理", "code": 933 }, { "name": "经销商", "code": 2149 }, { "name": "招商经理", "code": 2150 }, { "name": "招商主管", "code": 2151 }, { "name": "招商专员", "code": 2152 }, { "name": "会籍顾问", "code": 2153 }, { "name": "其他", "code": 18 }], [{ "name": "市场", "code": 4082000 }, { "name": "市场总监", "code": 158 }, { "name": "市场营销经理", "code": 159 }, { "name": "市场营销专员/助理", "code": 160 }, { "name": "市场策划/企划经理/主管", "code": 161 }, { "name": "市场调研与分析", "code": 167 }, { "name": "品牌经理", "code": 168 }, { "name": "品牌专员/助理", "code": 170 }, { "name": "市场专员/助理", "code": 171 }, { "name": "业务拓展经理/主管", "code": 311 }, { "name": "网站推广", "code": 451 }, { "name": "市场经理", "code": 600 }, { "name": "市场营销主管", "code": 601 }, { "name": "业务拓展专员/助理", "code": 602 }, { "name": "品牌主管", "code": 603 }, { "name": "市场主管", "code": 604 }, { "name": "市场策划/企划专员/助理", "code": 605 }, { "name": "选址拓展/新店开发", "code": 747 }, { "name": "促销主管/督导", "code": 748 }, { "name": "活动策划", "code": 749 }, { "name": "活动执行", "code": 759 }, { "name": "产品经理", "code": 847 }, { "name": "产品主管", "code": 848 }, { "name": "产品专员/助理", "code": 849 }, { "name": "促销员", "code": 850 }, { "name": "市场文案策划", "code": 851 }, { "name": "学术推广", "code": 853 }, { "name": "SEO/SEM", "code": 866 }, { "name": "品牌策划", "code": 2174 }, { "name": "市场通路专员", "code": 2175 }, { "name": "促销经理", "code": 2176 }, { "name": "其他", "code": 174 }], [{ "name": "公关/媒介", "code": 4084000 }, { "name": "公关总监", "code": 162 }, { "name": "公关专员/助理", "code": 163 }, { "name": "媒介经理/主管", "code": 164 }, { "name": "媒介专员/助理", "code": 165 }, { "name": "媒介策划/管理", "code": 513 }, { "name": "公关经理/主管", "code": 606 }, { "name": "政府事务管理", "code": 768 }, { "name": "媒介销售", "code": 2181 }, { "name": "活动执行", "code": 2182 }, { "name": "其他", "code": 607 }], [{ "name": "销售管理", "code": 7001000 }, { "name": "销售总监", "code": 2255 }, { "name": "销售经理", "code": 1 }, { "name": "销售主管", "code": 2 }, { "name": "渠道/分销总监", "code": 3 }, { "name": "客户经理", "code": 4 }, { "name": "区域销售总监", "code": 5 }, { "name": "渠道/分销经理/主管", "code": 453 }, { "name": "业务拓展经理/主管", "code": 454 }, { "name": "团购经理/主管", "code": 455 }, { "name": "客户主管", "code": 548 }, { "name": "大客户销售经理", "code": 660 }, { "name": "区域销售经理/主管", "code": 843 }, { "name": "医药销售经理/主管", "code": 844 }, { "name": "客户总监", "code": 845 }, { "name": "其他", "code": 458 }], [{ "name": "销售行政/商务", "code": 7002000 }, { "name": "销售行政专员/助理", "code": 15 }, { "name": "销售行政经理/主管", "code": 459 }, { "name": "商务专员/助理", "code": 460 }, { "name": "商务经理/主管", "code": 461 }, { "name": "销售数据分析", "code": 462 }, { "name": "销售培训师/讲师", "code": 463 }, { "name": "销售运营专员/助理", "code": 661 }, { "name": "销售运营经理/主管", "code": 662 }, { "name": "业务分析经理/主管", "code": 2230 }, { "name": "业务分析专员/助理", "code": 2231 }, { "name": "其他", "code": 464 }], [{ "name": "广告/会展", "code": 7004000 }, { "name": "会务专员/助理", "code": 172 }, { "name": "广告客户经理", "code": 506 }, { "name": "广告客户代表", "code": 507 }, { "name": "广告/会展业务拓展", "code": 508 }, { "name": "广告文案策划", "code": 509 }, { "name": "广告创意/设计师", "code": 510 }, { "name": "广告美术指导", "code": 512 }, { "name": "广告制作执行", "code": 514 }, { "name": "广告/会展项目管理", "code": 609 }, { "name": "会展策划/设计", "code": 610 }, { "name": "广告创意/设计总监", "code": 756 }, { "name": "广告创意/设计经理/主管", "code": 757 }, { "name": "广告客户总监", "code": 855 }, { "name": "广告客户主管", "code": 856 }, { "name": "会务经理/主管", "code": 857 }, { "name": "企业/业务发展经理", "code": 2237 }, { "name": "其他", "code": 515 }]], [{ "name": "财务|人力资源|行政" }, [{ "name": "财务/审计/税务", "code": 2060000 }, { "name": "财务总监", "code": 200 }, { "name": "财务经理", "code": 201 }, { "name": "财务主管/总帐主管", "code": 202 }, { "name": "财务分析经理/主管", "code": 203 }, { "name": "财务分析员", "code": 204 }, { "name": "财务助理", "code": 205 }, { "name": "会计经理/主管", "code": 206 }, { "name": "会计/会计师", "code": 207 }, { "name": "出纳员", "code": 208 }, { "name": "税务经理/主管", "code": 209 }, { "name": "税务专员/助理", "code": 210 }, { "name": "成本经理/主管", "code": 211 }, { "name": "审计经理/主管", "code": 212 }, { "name": "审计专员/助理", "code": 213 }, { "name": "统计员", "code": 214 }, { "name": "首席财务官CFO", "code": 399 }, { "name": "成本会计", "code": 527 }, { "name": "资产/资金管理", "code": 570 }, { "name": "会计助理/文员", "code": 713 }, { "name": "财务顾问", "code": 714 }, { "name": "资金专员", "code": 715 }, { "name": "固定资产会计", "code": 2098 }, { "name": "成本管理员", "code": 2099 }, { "name": "其他", "code": 215 }], [{ "name": "行政/后勤/文秘", "code": 3010000 }, { "name": "行政经理/主管/办公室主任", "code": 114 }, { "name": "行政专员/助理", "code": 115 }, { "name": "助理/秘书/文员", "code": 116 }, { "name": "前台/总机/接待", "code": 117 }, { "name": "后勤人员", "code": 119 }, { "name": "行政总监", "code": 328 }, { "name": "电脑操作/打字/录入员", "code": 498 }, { "name": "文档/资料管理", "code": 859 }, { "name": "党工团干事", "code": 2144 }, { "name": "图书管理员", "code": 2145 }, { "name": "内勤人员", "code": 2146 }, { "name": "其他", "code": 329 }], [{ "name": "人力资源", "code": 5002000 }, { "name": "人力资源总监", "code": 120 }, { "name": "人力资源经理", "code": 121 }, { "name": "人力资源专员/助理", "code": 122 }, { "name": "招聘经理/主管", "code": 123 }, { "name": "招聘专员/助理", "code": 124 }, { "name": "培训经理/主管", "code": 125 }, { "name": "培训专员/助理", "code": 126 }, { "name": "薪酬福利经理/主管", "code": 127 }, { "name": "猎头顾问/助理", "code": 128 }, { "name": "人力资源主管", "code": 618 }, { "name": "绩效考核经理/主管", "code": 619 }, { "name": "员工关系/企业文化/工会", "code": 620 }, { "name": "绩效考核专员/助理", "code": 778 }, { "name": "人事信息系统(HRIS)管理", "code": 779 }, { "name": "薪酬福利专员/助理", "code": 780 }, { "name": "企业培训师/讲师", "code": 858 }, { "name": "其他", "code": 130 }]], [{ "name": "项目|质量|高级管理" }, [{ "name": "项目管理/项目协调", "code": 201300 }, { "name": "项目总监", "code": 813 }, { "name": "项目经理/项目主管", "code": 814 }, { "name": "项目专员/助理", "code": 815 }, { "name": "广告/会展项目管理", "code": 816 }, { "name": "IT项目总监", "code": 817 }, { "name": "IT项目经理/主管", "code": 818 }, { "name": "IT项目执行/协调人员", "code": 819 }, { "name": "通信项目管理", "code": 820 }, { "name": "生产项目经理/主管", "code": 821 }, { "name": "生产项目工程师", "code": 822 }, { "name": "汽车工程项目管理", "code": 823 }, { "name": "电子/电器项目管理", "code": 824 }, { "name": "服装/纺织/皮革项目管理", "code": 825 }, { "name": "医药项目管理", "code": 826 }, { "name": "化工项目管理", "code": 827 }, { "name": "物流/仓储项目管理", "code": 828 }, { "name": "房地产项目配套工程师", "code": 829 }, { "name": "房地产项目管理", "code": 830 }, { "name": "保险项目经理/主管", "code": 831 }, { "name": "咨询项目管理", "code": 832 }, { "name": "能源/矿产项目管理", "code": 833 }, { "name": "证券/投资项目管理", "code": 834 }, { "name": "项目计划合约专员", "code": 2079 }, { "name": "项目招投标", "code": 2080 }, { "name": "其他", "code": 835 }], [{ "name": "高级管理", "code": 1050000 }, { "name": "首席执行官CEO/总裁/总经理", "code": 136 }, { "name": "CTO/CIO", "code": 137 }, { "name": "首席运营官COO", "code": 138 }, { "name": "首席财务官CFO", "code": 139 }, { "name": "副总裁/副总经理", "code": 140 }, { "name": "分公司/代表处负责人", "code": 141 }, { "name": "总裁助理/总经理助理", "code": 142 }, { "name": "合伙人", "code": 143 }, { "name": "部门/事业部管理", "code": 144 }, { "name": "总编/副总编", "code": 870 }, { "name": "行长/副行长", "code": 907 }, { "name": "工厂厂长/副厂长", "code": 911 }, { "name": "校长/副校长", "code": 912 }, { "name": "办事处首席代表", "code": 2001 }, { "name": "投资者关系", "code": 2002 }, { "name": "企业秘书/董事会秘书", "code": 2003 }, { "name": "策略发展总监", "code": 2004 }, { "name": "运营总监", "code": 2005 }, { "name": "其他", "code": 148 }], [{ "name": "质量管理/安全防护", "code": 2023405 }, { "name": "化验/检验", "code": 67 }, { "name": "质量管理/测试经理", "code": 249 }, { "name": "质量管理/测试主管", "code": 250 }, { "name": "质量管理/测试工程师", "code": 251 }, { "name": "质量检验员/测试员", "code": 252 }, { "name": "认证/体系工程师/审核员", "code": 253 }, { "name": "供应商/采购质量管理", "code": 330 }, { "name": "安全管理", "code": 331 }, { "name": "安全消防", "code": 384 }, { "name": "环境/健康/安全工程师", "code": 529 }, { "name": "环境/健康/安全经理/主管", "code": 807 }, { "name": "可靠度工程师", "code": 2081 }, { "name": "故障分析工程师", "code": 2082 }, { "name": "采购材料/设备管理", "code": 2083 }, { "name": "其他", "code": 254 }]], [{ "name": "IT|互联网|通信" }, [{ "name": "软件/互联网开发/系统集成", "code": 160000 }, { "name": "高级软件工程师", "code": 44 }, { "name": "软件工程师", "code": 45 }, { "name": "数据库开发工程师", "code": 47 }, { "name": "ERP技术/开发应用", "code": 48 }, { "name": "互联网软件工程师", "code": 53 }, { "name": "网页设计/制作/美工", "code": 54 }, { "name": "游戏设计/开发", "code": 57 }, { "name": "软件研发工程师", "code": 79 }, { "name": "语音/视频/图形开发", "code": 317 }, { "name": "需求工程师", "code": 665 }, { "name": "系统集成工程师", "code": 666 }, { "name": "系统架构设计师", "code": 667 }, { "name": "系统分析员", "code": 668 }, { "name": "用户界面（UI）设计", "code": 669 }, { "name": "游戏策划", "code": 671 }, { "name": "游戏界面设计", "code": 672 }, { "name": "手机软件开发工程师", "code": 679 }, { "name": "嵌入式软件开发", "code": 687 }, { "name": "用户体验（UE/UX）设计", "code": 861 }, { "name": "移动互联网开发", "code": 863 }, { "name": "WEB前端开发", "code": 864 }, { "name": "算法工程师", "code": 2034 }, { "name": "仿真应用工程师", "code": 2035 }, { "name": "计算机辅助设计师", "code": 2036 }, { "name": "网站架构设计师", "code": 2037 }, { "name": "IOS开发工程师", "code": 2038 }, { "name": "Android开发工程师", "code": 2039 }, { "name": "Java开发工程师", "code": 2040 }, { "name": "PHP开发工程师", "code": 2041 }, { "name": "C语言开发工程师", "code": 2042 }, { "name": "脚本开发工程师", "code": 2043 }, { "name": "其他", "code": 60 }], [{ "name": "互联网产品/运营管理", "code": 160200 }, { "name": "网络运营管理", "code": 52 }, { "name": "网站编辑", "code": 56 }, { "name": "互联网产品经理/主管", "code": 316 }, { "name": "SEO/SEM", "code": 552 }, { "name": "网络运营专员/助理", "code": 670 }, { "name": "互联网产品专员/助理", "code": 675 }, { "name": "电子商务经理/主管", "code": 676 }, { "name": "电子商务专员/助理", "code": 677 }, { "name": "产品总监", "code": 2046 }, { "name": "运营总监", "code": 2047 }, { "name": "网站运营总监/经理", "code": 2048 }, { "name": "电子商务总监", "code": 2049 }, { "name": "新媒体运营", "code": 2050 }, { "name": "网店店长", "code": 2051 }, { "name": "网店推广", "code": 2052 }, { "name": "网店客服", "code": 2053 }, { "name": "网店运营", "code": 2054 }, { "name": "网店管理员", "code": 2055 }, { "name": "运营主管/专员", "code": 2056 }, { "name": "微信推广", "code": 2057 }, { "name": "淘宝/微信运营专员/主管", "code": 2058 }, { "name": "产品运营", "code": 2059 }, { "name": "数据运营", "code": 2060 }, { "name": "市场运营", "code": 2061 }, { "name": "内容运营", "code": 2062 }, { "name": "其他", "code": 556 }], [{ "name": "硬件开发", "code": 160300 }, { "name": "硬件工程师", "code": 43 }, { "name": "高级硬件工程师", "code": 314 }, { "name": "嵌入式硬件开发", "code": 407 }, { "name": "其他", "code": 557 }], [{ "name": "IT质量管理/测试/配置管理", "code": 160400 }, { "name": "IT质量管理工程师", "code": 49 }, { "name": "信息技术标准化工程师", "code": 692 }, { "name": "IT质量管理经理/主管", "code": 693 }, { "name": "系统测试", "code": 694 }, { "name": "软件测试", "code": 695 }, { "name": "硬件测试", "code": 696 }, { "name": "配置管理工程师", "code": 868 }, { "name": "标准化工程师", "code": 2063 }, { "name": "游戏测试", "code": 2064 }, { "name": "手机维修", "code": 2065 }, { "name": "其他", "code": 561 }], [{ "name": "IT管理/项目协调", "code": 200300 }, { "name": "IT项目经理/主管", "code": 42 }, { "name": "IT技术/研发经理/主管", "code": 313 }, { "name": "CTO/CIO", "code": 398 }, { "name": "IT项目总监", "code": 688 }, { "name": "IT项目执行/协调人员", "code": 689 }, { "name": "IT技术/研发总监", "code": 928 }, { "name": "其他", "code": 841 }], [{ "name": "IT运维/技术支持", "code": 200500 }, { "name": "信息技术经理/主管", "code": 40 }, { "name": "信息技术专员", "code": 41 }, { "name": "系统工程师", "code": 46 }, { "name": "系统管理员", "code": 51 }, { "name": "网络工程师", "code": 55 }, { "name": "IT技术支持/维护经理", "code": 58 }, { "name": "网络与信息安全工程师", "code": 59 }, { "name": "IT技术支持/维护工程师", "code": 315 }, { "name": "网络管理员", "code": 388 }, { "name": "数据库管理员", "code": 389 }, { "name": "ERP实施顾问", "code": 551 }, { "name": "计算机硬件维护工程师", "code": 678 }, { "name": "IT技术文员/助理", "code": 690 }, { "name": "Helpdesk", "code": 698 }, { "name": "IT文档工程师", "code": 699 }, { "name": "其他", "code": 840 }], [{ "name": "电信/通信技术开发及应用", "code": 5001000 }, { "name": "有线传输工程师", "code": 320 }, { "name": "无线/射频通信工程师", "code": 321 }, { "name": "电信交换工程师", "code": 322 }, { "name": "数据通信工程师", "code": 323 }, { "name": "移动通信工程师", "code": 324 }, { "name": "电信网络工程师", "code": 325 }, { "name": "通信电源工程师", "code": 326 }, { "name": "通信项目管理", "code": 499 }, { "name": "通信研发工程师", "code": 500 }, { "name": "通信标准化工程师", "code": 558 }, { "name": "通信技术工程师", "code": 680 }, { "name": "增值产品开发工程师", "code": 2183 }, { "name": "其他", "code": 327 }]], [{ "name": "房产|建筑|物业管理" }, [{ "name": "土木/建筑/装修/市政工程", "code": 140000 }, { "name": "建筑工程师", "code": 96 }, { "name": "土木/土建/结构工程师", "code": 97 }, { "name": "给排水/暖通/空调工程", "code": 99 }, { "name": "室内装潢设计", "code": 100 }, { "name": "工程造价/预结算", "code": 102 }, { "name": "城市规划与设计", "code": 103 }, { "name": "工程监理/质量管理", "code": 106 }, { "name": "施工员", "code": 107 }, { "name": "智能大厦/布线/弱电/安防", "code": 289 }, { "name": "高级建筑工程师/总工", "code": 350 }, { "name": "建筑工程测绘/测量", "code": 383 }, { "name": "道路/桥梁/隧道工程技术", "code": 466 }, { "name": "市政工程师", "code": 562 }, { "name": "园林/景观设计", "code": 563 }, { "name": "幕墙工程师", "code": 564 }, { "name": "建筑工程安全管理", "code": 565 }, { "name": "建筑制图", "code": 703 }, { "name": "工程资料管理", "code": 704 }, { "name": "建筑施工现场管理", "code": 705 }, { "name": "施工队长", "code": 706 }, { "name": "岩土工程", "code": 707 }, { "name": "建筑设计师", "code": 884 }, { "name": "水利/港口工程技术", "code": 885 }, { "name": "架线和管道工程技术", "code": 886 }, { "name": "软装设计师", "code": 2023 }, { "name": "工程总监", "code": 2024 }, { "name": "土建勘察", "code": 2025 }, { "name": "硬装设计师", "code": 2026 }, { "name": "橱柜设计师", "code": 2027 }, { "name": "其他", "code": 108 }], [{ "name": "房地产开发/经纪/中介", "code": 141000 }, { "name": "房地产中介/交易", "code": 105 }, { "name": "房地产项目策划专员/助理", "code": 351 }, { "name": "房地产项目管理", "code": 566 }, { "name": "房地产评估", "code": 567 }, { "name": "房地产项目开发报建", "code": 701 }, { "name": "房地产销售/置业顾问", "code": 708 }, { "name": "房地产销售经理", "code": 709 }, { "name": "房地产项目策划经理/主管", "code": 710 }, { "name": "房地产项目配套工程师", "code": 711 }, { "name": "房地产销售主管", "code": 882 }, { "name": "房地产项目招投标", "code": 883 }, { "name": "房地产资产管理", "code": 2028 }, { "name": "监察人员", "code": 2029 }, { "name": "地产店长/经理", "code": 2030 }, { "name": "房地产内勤", "code": 2031 }, { "name": "房地产客服", "code": 2032 }, { "name": "其他", "code": 568 }], [{ "name": "物业管理", "code": 142000 }, { "name": "物业管理专员/助理", "code": 95 }, { "name": "物业租赁/销售", "code": 101 }, { "name": "物业维修", "code": 352 }, { "name": "物业经理/主管", "code": 393 }, { "name": "物业招商管理", "code": 465 }, { "name": "物业顾问", "code": 712 }, { "name": "监控维护", "code": 2033 }, { "name": "其他", "code": 569 }]], [{ "name": "金融" }, [{ "name": "信托/担保/拍卖/典当", "code": 200900 }, { "name": "珠宝/收藏品鉴定", "code": 811 }, { "name": "担保业务", "code": 921 }, { "name": "拍卖师", "code": 929 }, { "name": "信托服务", "code": 930 }, { "name": "典当业务", "code": 931 }, { "name": "其他", "code": 812 }], [{ "name": "证券/期货/投资管理/服务", "code": 2070000 }, { "name": "证券/期货/外汇经纪人", "code": 187 }, { "name": "投资/理财服务", "code": 188 }, { "name": "风险管理/控制/稽查", "code": 190 }, { "name": "证券/投资客户经理", "code": 191 }, { "name": "储备经理人", "code": 198 }, { "name": "融资总监", "code": 346 }, { "name": "证券总监/部门经理", "code": 349 }, { "name": "证券/投资项目管理", "code": 468 }, { "name": "证券分析/金融研究", "code": 575 }, { "name": "投资银行业务", "code": 576 }, { "name": "股票/期货操盘手", "code": 577 }, { "name": "资产评估", "code": 579 }, { "name": "融资经理/主管", "code": 809 }, { "name": "融资专员/助理", "code": 810 }, { "name": "证券/投资客户主管", "code": 908 }, { "name": "证券/投资客户代表", "code": 909 }, { "name": "证券/投资客户总监", "code": 910 }, { "name": "金融/经济研究员", "code": 2100 }, { "name": "金融产品经理", "code": 2101 }, { "name": "金融产品销售", "code": 2102 }, { "name": "基金项目经理", "code": 2103 }, { "name": "金融服务经理", "code": 2104 }, { "name": "投资经理", "code": 2105 }, { "name": "投资银行财务分析", "code": 2106 }, { "name": "金融租赁", "code": 2107 }, { "name": "其他", "code": 199 }], [{ "name": "银行", "code": 2071000 }, { "name": "银行客户服务", "code": 192 }, { "name": "银行会计/柜员", "code": 193 }, { "name": "信贷管理/资信评估/分析", "code": 194 }, { "name": "银行经理/主任", "code": 347 }, { "name": "银行卡/电子银行业务推广", "code": 571 }, { "name": "公司业务", "code": 572 }, { "name": "个人业务", "code": 573 }, { "name": "行长/副行长", "code": 716 }, { "name": "外汇交易", "code": 717 }, { "name": "银行客户经理", "code": 718 }, { "name": "综合业务经理/主管", "code": 719 }, { "name": "综合业务专员/助理", "code": 720 }, { "name": "银行大堂经理", "code": 721 }, { "name": "进出口/信用证结算", "code": 722 }, { "name": "清算人员", "code": 723 }, { "name": "风险控制", "code": 724 }, { "name": "信审核查", "code": 725 }, { "name": "银行客户总监", "code": 887 }, { "name": "银行客户主管", "code": 888 }, { "name": "银行客户代表", "code": 889 }, { "name": "个人业务部门经理/主管", "code": 2108 }, { "name": "公司业务部门经理/主管", "code": 2109 }, { "name": "高级客户经理/客户经理", "code": 2110 }, { "name": "信用卡销售", "code": 2111 }, { "name": "银行柜员", "code": 2112 }, { "name": "其他", "code": 574 }], [{ "name": "保险", "code": 7006000 }, { "name": "保险代理/经纪人/客户经理", "code": 196 }, { "name": "核保理赔", "code": 197 }, { "name": "保险精算师", "code": 348 }, { "name": "保险业务管理", "code": 535 }, { "name": "保险项目经理/主管", "code": 536 }, { "name": "保险顾问/财务规划师", "code": 537 }, { "name": "保险内勤", "code": 539 }, { "name": "保险产品开发/项目策划", "code": 540 }, { "name": "客户服务/续期管理", "code": 541 }, { "name": "保险培训师", "code": 543 }, { "name": "储备经理人", "code": 544 }, { "name": "保险契约管理", "code": 545 }, { "name": "汽车定损/车险理赔", "code": 726 }, { "name": "理财顾问/财务规划师", "code": 2251 }, { "name": "保险电销", "code": 2252 }, { "name": "保险核安", "code": 2253 }, { "name": "其他", "code": 546 }]], [{ "name": "采购|贸易|交通|物流" }, [{ "name": "交通运输服务", "code": 4010300 }, { "name": "飞机驾驶/操作", "code": 245 }, { "name": "机动车司机/驾驶", "code": 246 }, { "name": "列车乘务", "code": 489 }, { "name": "公交/地铁乘务", "code": 594 }, { "name": "地勤人员", "code": 736 }, { "name": "航空乘务", "code": 737 }, { "name": "船员/水手", "code": 878 }, { "name": "列车驾驶/操作", "code": 879 }, { "name": "船舶驾驶/操作", "code": 880 }, { "name": "船舶乘务", "code": 881 }, { "name": "安检员", "code": 2154 }, { "name": "驾驶教练", "code": 2155 }, { "name": "交通管理员", "code": 2156 }, { "name": "船长", "code": 2157 }, { "name": "代驾", "code": 2158 }, { "name": "其他", "code": 248 }], [{ "name": "物流/仓储", "code": 4010400 }, { "name": "物流总监", "code": 241 }, { "name": "物流专员/助理", "code": 242 }, { "name": "仓库经理/主管", "code": 243 }, { "name": "仓库/物料管理员", "code": 244 }, { "name": "快递员/速递员", "code": 247 }, { "name": "运输经理/主管", "code": 353 }, { "name": "物流/仓储调度", "code": 394 }, { "name": "单证员", "code": 490 }, { "name": "搬运工", "code": 491 }, { "name": "物流经理/主管", "code": 597 }, { "name": "货运代理", "code": 740 }, { "name": "集装箱业务", "code": 741 }, { "name": "报关员", "code": 742 }, { "name": "物流/仓储项目管理", "code": 744 }, { "name": "理货/分拣/打包", "code": 745 }, { "name": "水运/空运/陆运操作", "code": 746 }, { "name": "集装箱维护", "code": 2159 }, { "name": "集装箱操作", "code": 2160 }, { "name": "物流销售", "code": 2161 }, { "name": "供应链总监", "code": 2162 }, { "name": "供应链经理/主管", "code": 2163 }, { "name": "物料经理", "code": 2164 }, { "name": "物料主管/专员", "code": 2165 }, { "name": "项目经理/主管", "code": 2166 }, { "name": "海关事务管理", "code": 2167 }, { "name": "船务/空运陆运操作", "code": 2168 }, { "name": "订单处理员", "code": 2169 }, { "name": "水运/陆运/空运销售", "code": 2170 }, { "name": "外卖快递", "code": 2254 }, { "name": "其他", "code": 598 }], [{ "name": "采购/贸易", "code": 4083000 }, { "name": "采购总监", "code": 235 }, { "name": "采购专员/助理", "code": 236 }, { "name": "外贸/贸易专员/助理", "code": 237 }, { "name": "贸易跟单", "code": 238 }, { "name": "报关员", "code": 239 }, { "name": "外贸/贸易经理/主管", "code": 312 }, { "name": "供应链管理", "code": 488 }, { "name": "采购经理/主管", "code": 550 }, { "name": "供应商开发", "code": 663 }, { "name": "买手", "code": 664 }, { "name": "业务跟单经理", "code": 2177 }, { "name": "高级业务跟单", "code": 2178 }, { "name": "助理业务跟单", "code": 2179 }, { "name": "国际贸易主管/专员", "code": 2180 }, { "name": "其他", "code": 240 }]], [{ "name": "生产|制造" }, [{ "name": "化工", "code": 120500 }, { "name": "化工工程师", "code": 23 }, { "name": "化学操作", "code": 111 }, { "name": "化学技术应用", "code": 112 }, { "name": "化学制剂研发", "code": 371 }, { "name": "化学分析", "code": 396 }, { "name": "化工研发工程师", "code": 502 }, { "name": "化工项目管理", "code": 503 }, { "name": "化学实验室技术员/研究员", "code": 504 }, { "name": "油漆/化工涂料研发", "code": 505 }, { "name": "塑料工程师", "code": 614 }, { "name": "橡胶工程师", "code": 2006 }, { "name": "配色技术员", "code": 2007 }, { "name": "化妆品研发", "code": 2008 }, { "name": "造纸研发", "code": 2009 }, { "name": "化学/化工技术总监", "code": 2010 }, { "name": "其他", "code": 113 }], [{ "name": "生产管理/运营", "code": 121100 }, { "name": "工厂厂长/副厂长", "code": 61 }, { "name": "生产项目工程师", "code": 62 }, { "name": "生产项目经理/主管", "code": 63 }, { "name": "生产主管/督导/组长", "code": 64 }, { "name": "生产经理/车间主任", "code": 65 }, { "name": "生产设备管理", "code": 68 }, { "name": "生产物料管理（PMC）", "code": 69 }, { "name": "工艺/制程工程师", "code": 72 }, { "name": "工业工程师", "code": 74 }, { "name": "制造工程师", "code": 75 }, { "name": "技术文档工程师", "code": 90 }, { "name": "生产计划", "code": 487 }, { "name": "包装工程师", "code": 592 }, { "name": "生产总监", "code": 869 }, { "name": "产品管理", "code": 871 }, { "name": "生产运营管理", "code": 932 }, { "name": "总工程师/副总工程师", "code": 2011 }, { "name": "生产文员", "code": 2012 }, { "name": "营运主管", "code": 2013 }, { "name": "营运经理", "code": 2014 }, { "name": "设备主管", "code": 2015 }, { "name": "化验师", "code": 2016 }, { "name": "生产跟单", "code": 2017 }, { "name": "其他", "code": 77 }], [{ "name": "生物/制药/医疗器械", "code": 121300 }, { "name": "生物工程/生物制药", "code": 292 }, { "name": "临床研究员", "code": 293 }, { "name": "药品生产/质量管理", "code": 294 }, { "name": "医药代表", "code": 296 }, { "name": "医疗器械推广", "code": 378 }, { "name": "医药项目管理", "code": 495 }, { "name": "医药招商", "code": 496 }, { "name": "医药化学分析", "code": 763 }, { "name": "医药技术研发管理人员", "code": 764 }, { "name": "临床数据分析员", "code": 765 }, { "name": "药品市场推广经理/主管", "code": 766 }, { "name": "药品市场推广专员/助理", "code": 767 }, { "name": "医药项目招投标管理", "code": 769 }, { "name": "医药销售经理/主管", "code": 770 }, { "name": "医疗器械注册", "code": 771 }, { "name": "医疗器械生产/质量管理", "code": 772 }, { "name": "医疗器械销售", "code": 773 }, { "name": "医疗器械维修/保养", "code": 774 }, { "name": "医药学术推广", "code": 775 }, { "name": "药品研发", "code": 776 }, { "name": "药品注册", "code": 875 }, { "name": "医疗器械研发", "code": 876 }, { "name": "临床协调员", "code": 877 }, { "name": "临床推广经理", "code": 2018 }, { "name": "医药技术研发人员", "code": 2019 }, { "name": "其他", "code": 297 }], [{ "name": "电子/电器/半导体/仪器仪表", "code": 160100 }, { "name": "自动化工程师", "code": 33 }, { "name": "电子/电器工程师", "code": 78 }, { "name": "半导体技术", "code": 81 }, { "name": "电子元器件工程师", "code": 82 }, { "name": "电池/电源开发", "code": 83 }, { "name": "现场应用工程师（FAE）", "code": 84 }, { "name": "家用电器/数码产品研发", "code": 85 }, { "name": "仪器/仪表/计量工程师", "code": 86 }, { "name": "电路工程师/技术员", "code": 89 }, { "name": "电子/电器工艺/制程工程师", "code": 91 }, { "name": "无线电工程师", "code": 318 }, { "name": "电子/电器设备工程师", "code": 401 }, { "name": "音频/视频工程师/技术员", "code": 402 }, { "name": "电子/电器维修/保养", "code": 403 }, { "name": "集成电路IC设计/应用工程师", "code": 404 }, { "name": "IC验证工程师", "code": 405 }, { "name": "模拟电路设计/应用工程师", "code": 406 }, { "name": "版图设计工程师", "code": 408 }, { "name": "电子/电器项目管理", "code": 409 }, { "name": "测试/可靠性工程师", "code": 410 }, { "name": "激光/光电子技术", "code": 411 }, { "name": "电气设计", "code": 467 }, { "name": "电器研发工程师", "code": 528 }, { "name": "光源/照明工程师", "code": 559 }, { "name": "空调工程/设计", "code": 560 }, { "name": "变压器与磁电工程师", "code": 681 }, { "name": "线路结构设计", "code": 682 }, { "name": "电气线路设计", "code": 683 }, { "name": "射频工程师", "code": 684 }, { "name": "电子技术研发工程师", "code": 686 }, { "name": "安防系统工程师", "code": 808 }, { "name": "电气工程师", "code": 865 }, { "name": "电子工程师/技术员", "code": 2044 }, { "name": "电声/音响工程师/技术员", "code": 2045 }, { "name": "其他", "code": 94 }], [{ "name": "机械设计/制造/维修", "code": 5003000 }, { "name": "机械工程师", "code": 29 }, { "name": "机械设计师", "code": 93 }, { "name": "工程机械经理", "code": 332 }, { "name": "工程机械主管", "code": 333 }, { "name": "机械制图员", "code": 334 }, { "name": "机械设备工程师", "code": 583 }, { "name": "机械研发工程师", "code": 584 }, { "name": "机械工艺/制程工程师", "code": 585 }, { "name": "机械结构工程师", "code": 586 }, { "name": "气动工程师", "code": 587 }, { "name": "模具工程师", "code": 588 }, { "name": "机械维修/保养", "code": 589 }, { "name": "铸造/锻造工程师/技师", "code": 590 }, { "name": "CNC/数控工程师", "code": 591 }, { "name": "材料工程师", "code": 593 }, { "name": "列车设计与制造", "code": 595 }, { "name": "机械设备经理", "code": 729 }, { "name": "机电工程师", "code": 732 }, { "name": "飞机维修/保养", "code": 734 }, { "name": "飞机设计与制造", "code": 735 }, { "name": "夹具工程师", "code": 873 }, { "name": "注塑工程师", "code": 874 }, { "name": "列车维修/保养", "code": 920 }, { "name": "船舶维修/保养", "code": 922 }, { "name": "船舶设计与制造", "code": 923 }, { "name": "技术研发工程师", "code": 2184 }, { "name": "技术研发经理/主管", "code": 2185 }, { "name": "产品策划工程师", "code": 2186 }, { "name": "项目管理", "code": 2187 }, { "name": "实验室负责人/工程师", "code": 2188 }, { "name": "工业工程师", "code": 2189 }, { "name": "维修经理/主管", "code": 2190 }, { "name": "装配工程师/客户经理", "code": 2191 }, { "name": "焊接工程师/技师", "code": 2192 }, { "name": "冲压工程师/技师", "code": 2193 }, { "name": "锅炉工程师/技师", "code": 2194 }, { "name": "光伏系统工程师", "code": 2195 }, { "name": "汽车/摩托车工程师", "code": 2196 }, { "name": "轨道交通工程师/技术员", "code": 2197 }, { "name": "数控操作", "code": 2198 }, { "name": "数控编程", "code": 2199 }, { "name": "无损检测工程师", "code": 2200 }, { "name": "浮法操作工(玻璃技术)", "code": 2201 }, { "name": "地铁轨道设计", "code": 2202 }, { "name": "机修工", "code": 2203 }, { "name": "工装工程师", "code": 2204 }, { "name": "其他", "code": 335 }], [{ "name": "技工/操作工", "code": 5004000 }, { "name": "汽车维修/保养", "code": 336 }, { "name": "电焊工/铆焊工", "code": 337 }, { "name": "钳工/机修工/钣金工", "code": 338 }, { "name": "车床/磨床/铣床/冲床工", "code": 339 }, { "name": "空调工/电梯工/锅炉工", "code": 340 }, { "name": "铲车/叉车工", "code": 341 }, { "name": "水工/木工/油漆工", "code": 342 }, { "name": "模具工", "code": 343 }, { "name": "普工/操作工", "code": 344 }, { "name": "电工", "code": 599 }, { "name": "技工", "code": 2205 }, { "name": "组装工", "code": 2206 }, { "name": "包装工", "code": 2207 }, { "name": "电力线路工", "code": 2208 }, { "name": "拖压工", "code": 2209 }, { "name": "仪表工", "code": 2210 }, { "name": "电镀工", "code": 2211 }, { "name": "喷塑工", "code": 2212 }, { "name": "电梯工", "code": 2213 }, { "name": "吊车司机/卡车司机", "code": 2214 }, { "name": "洗车工", "code": 2215 }, { "name": "洗碗工", "code": 2216 }, { "name": "瓦工", "code": 2217 }, { "name": "万能工", "code": 2218 }, { "name": "钢筋工", "code": 2220 }, { "name": "学徒工", "code": 2221 }, { "name": "其他", "code": 345 }], [{ "name": "汽车制造", "code": 7003000 }, { "name": "车身设计工程师", "code": 470 }, { "name": "汽车工程项目管理", "code": 471 }, { "name": "汽车装配工艺工程师", "code": 472 }, { "name": "汽车零部件设计师", "code": 473 }, { "name": "汽车底盘/总装工程师", "code": 474 }, { "name": "汽车机械工程师", "code": 475 }, { "name": "汽车电子工程师", "code": 476 }, { "name": "安全性能工程师", "code": 478 }, { "name": "汽车动力系统工程师", "code": 872 }, { "name": "汽车机构工程师", "code": 2232 }, { "name": "汽车电工", "code": 2233 }, { "name": "售后服务/客户服务", "code": 2234 }, { "name": "加油站工作员", "code": 2235 }, { "name": "发动机/总装工程师", "code": 2236 }, { "name": "其他", "code": 485 }], [{ "name": "汽车销售与服务", "code": 7003100 }, { "name": "汽车销售", "code": 469 }, { "name": "4S店管理", "code": 477 }, { "name": "汽车零配件销售", "code": 479 }, { "name": "汽车定损/车险理赔", "code": 480 }, { "name": "汽车装饰美容", "code": 483 }, { "name": "二手车评估师", "code": 484 }, { "name": "汽车售后服务/客户服务", "code": 581 }, { "name": "汽车质量管理/检验检测", "code": 727 }, { "name": "汽车维修/保养", "code": 728 }, { "name": "其他", "code": 582 }], [{ "name": "服装/纺织/皮革设计/生产", "code": 7005000 }, { "name": "服装/纺织品设计", "code": 155 }, { "name": "服装/纺织品/皮革销售", "code": 516 }, { "name": "服装/纺织/皮革项目管理", "code": 517 }, { "name": "服装/纺织品/皮革质量管理", "code": 519 }, { "name": "服装/纺织/皮革跟单", "code": 520 }, { "name": "面料辅料开发/采购", "code": 521 }, { "name": "服装打样/制版", "code": 522 }, { "name": "样衣工", "code": 523 }, { "name": "裁床", "code": 524 }, { "name": "电脑放码员", "code": 738 }, { "name": "服装/纺织/皮革工艺师", "code": 739 }, { "name": "服装/纺织设计总监", "code": 2238 }, { "name": "纸样师/车板师", "code": 2239 }, { "name": "剪裁工", "code": 2240 }, { "name": "缝纫工", "code": 2241 }, { "name": "纺织工/针织工", "code": 2242 }, { "name": "配色工", "code": 2243 }, { "name": "印染工", "code": 2244 }, { "name": "漂染工", "code": 2245 }, { "name": "挡车工", "code": 2246 }, { "name": "浆纱工", "code": 2247 }, { "name": "整经工", "code": 2248 }, { "name": "鞋子设计", "code": 2249 }, { "name": "细纱工", "code": 2250 }, { "name": "其他", "code": 525 }]], [{ "name": "传媒|印刷|艺术|设计" }, [{ "name": "艺术/设计", "code": 2100708 }, { "name": "平面设计", "code": 149 }, { "name": "包装设计", "code": 150 }, { "name": "多媒体/动画设计", "code": 151 }, { "name": "艺术/设计总监", "code": 153 }, { "name": "美术编辑/美术设计", "code": 184 }, { "name": "设计管理人员", "code": 364 }, { "name": "工艺品/珠宝设计", "code": 365 }, { "name": "家具设计", "code": 366 }, { "name": "三维/3D设计/制作", "code": 554 }, { "name": "Flash设计/开发", "code": 555 }, { "name": "CAD设计/制图", "code": 608 }, { "name": "特效设计", "code": 673 }, { "name": "视觉设计", "code": 674 }, { "name": "工业设计", "code": 750 }, { "name": "家居用品设计", "code": 751 }, { "name": "玩具设计", "code": 752 }, { "name": "绘画", "code": 753 }, { "name": "原画师", "code": 754 }, { "name": "店面/展览/展示/陈列设计", "code": 755 }, { "name": "用户体验（UE/UX）设计", "code": 862 }, { "name": "游戏界面设计", "code": 867 }, { "name": "园林景观设计师", "code": 2118 }, { "name": "平面设计总监", "code": 2119 }, { "name": "平面设计经理/主管", "code": 2120 }, { "name": "其他", "code": 157 }], [{ "name": "影视/媒体/出版/印刷", "code": 2120000 }, { "name": "文案策划", "code": 152 }, { "name": "导演/编导", "code": 175 }, { "name": "文字编辑/组稿", "code": 176 }, { "name": "主持人/司仪", "code": 177 }, { "name": "经纪人/星探", "code": 178 }, { "name": "摄影师/摄像师", "code": 179 }, { "name": "艺术指导/舞美设计", "code": 180 }, { "name": "排版设计", "code": 181 }, { "name": "化妆师/造型师/服装/道具", "code": 182 }, { "name": "发行管理", "code": 183 }, { "name": "后期制作", "code": 185 }, { "name": "总编/副总编", "code": 367 }, { "name": "校对/录入", "code": 395 }, { "name": "印刷排版/制版", "code": 533 }, { "name": "记者/采编", "code": 612 }, { "name": "印刷操作", "code": 613 }, { "name": "放映管理", "code": 760 }, { "name": "电话采编", "code": 761 }, { "name": "作家/编剧/撰稿人", "code": 762 }, { "name": "音效师", "code": 890 }, { "name": "配音员", "code": 891 }, { "name": "美术编辑/美术设计", "code": 892 }, { "name": "演员/模特", "code": 893 }, { "name": "编辑出版", "code": 2121 }, { "name": "主笔设计师", "code": 2122 }, { "name": "放映员", "code": 2123 }, { "name": "灯光师", "code": 2124 }, { "name": "艺术/设计总监", "code": 2125 }, { "name": "影视策划/制作人员", "code": 2126 }, { "name": "调色员", "code": 2127 }, { "name": "烫金工", "code": 2128 }, { "name": "晒版员", "code": 2129 }, { "name": "装订工", "code": 2130 }, { "name": "数码直印/菲林输出", "code": 2131 }, { "name": "调墨技师", "code": 2132 }, { "name": "电分操作员", "code": 2133 }, { "name": "打稿机操作员", "code": 2134 }, { "name": "切纸机操作工", "code": 2135 }, { "name": "裱胶工", "code": 2136 }, { "name": "复卷工", "code": 2137 }, { "name": "压痕工", "code": 2138 }, { "name": "印刷机械机长", "code": 2139 }, { "name": "转播工程师", "code": 2140 }, { "name": "视频主播", "code": 2141 }, { "name": "其他", "code": 186 }]], [{ "name": "咨询|法律|教育|翻译" }, [{ "name": "律师/法务/合规", "code": 2080000 }, { "name": "律师", "code": 223 }, { "name": "企业律师/合规顾问", "code": 224 }, { "name": "法务经理/主管", "code": 225 }, { "name": "知识产权/专利顾问/代理人", "code": 226 }, { "name": "企业律师/合规经理/主管", "code": 363 }, { "name": "合同管理", "code": 497 }, { "name": "法务专员/助理", "code": 629 }, { "name": "律师助理", "code": 860 }, { "name": "合规经理", "code": 2113 }, { "name": "其他", "code": 227 }], [{ "name": "教育/培训", "code": 2090000 }, { "name": "培训师/讲师", "code": 131 }, { "name": "教学/教务管理人员", "code": 132 }, { "name": "教育产品开发", "code": 135 }, { "name": "大学教师", "code": 358 }, { "name": "家教", "code": 359 }, { "name": "体育老师/教练", "code": 360 }, { "name": "幼教", "code": 361 }, { "name": "校长/副校长", "code": 624 }, { "name": "高中教师", "code": 625 }, { "name": "职业技术教师", "code": 626 }, { "name": "初中教师", "code": 627 }, { "name": "小学教师", "code": 628 }, { "name": "兼职教师", "code": 785 }, { "name": "培训督导", "code": 786 }, { "name": "培训策划", "code": 787 }, { "name": "培训助理/助教", "code": 788 }, { "name": "培训/招生/课程顾问", "code": 789 }, { "name": "音乐教师", "code": 790 }, { "name": "理科教师", "code": 791 }, { "name": "文科教师", "code": 792 }, { "name": "外语教师", "code": 793 }, { "name": "美术教师", "code": 906 }, { "name": "大学教授", "code": 2114 }, { "name": "舞蹈老师", "code": 2115 }, { "name": "外籍教师", "code": 2116 }, { "name": "特教(特殊教育)", "code": 2117 }, { "name": "其他", "code": 134 }], [{ "name": "翻译（口译与笔译）", "code": 2120500 }, { "name": "英语翻译", "code": 268 }, { "name": "日语翻译", "code": 269 }, { "name": "德语翻译", "code": 270 }, { "name": "法语翻译", "code": 271 }, { "name": "俄语翻译", "code": 272 }, { "name": "韩语/朝鲜语翻译", "code": 273 }, { "name": "其他语种翻译", "code": 274 }, { "name": "西班牙语翻译", "code": 630 }, { "name": "意大利语翻译", "code": 631 }, { "name": "葡萄牙语翻译", "code": 632 }, { "name": "阿拉伯语翻译", "code": 633 }, {}], [{ "name": "咨询/顾问/调研/数据分析", "code": 2140000 }, { "name": "咨询总监", "code": 216 }, { "name": "咨询经理/主管", "code": 217 }, { "name": "咨询顾问/咨询员", "code": 219 }, { "name": "专业顾问", "code": 220 }, { "name": "情报信息分析", "code": 221 }, { "name": "调研员", "code": 623 }, { "name": "猎头顾问/助理", "code": 781 }, { "name": "咨询项目管理", "code": 783 }, { "name": "数据分析师", "code": 894 }, { "name": "咨询师", "code": 2142 }, { "name": "其他", "code": 222 }]], [{ "name": "服务业" }, [{ "name": "烹饪/料理/食品研发", "code": 201100 }, { "name": "厨师/面点师", "code": 275 }, { "name": "调酒师/茶艺师/咖啡师", "code": 369 }, { "name": "营养师", "code": 370 }, { "name": "食品/饮料研发", "code": 596 }, { "name": "食品加工/处理", "code": 635 }, { "name": "厨工", "code": 801 }, { "name": "食品/饮料检验", "code": 836 }, { "name": "餐厅领班", "code": 2066 }, { "name": "餐厅服务员", "code": 2067 }, { "name": "行政主厨", "code": 2068 }, { "name": "中餐厨师", "code": 2069 }, { "name": "西餐厨师", "code": 2070 }, { "name": "日式厨师", "code": 2071 }, { "name": "西点师", "code": 2072 }, { "name": "厨师助理/学徒", "code": 2073 }, { "name": "送餐员", "code": 2074 }, { "name": "传菜员", "code": 2075 }, { "name": "烧烤师", "code": 2076 }, { "name": "品酒师", "code": 2077 }, { "name": "杂工", "code": 2078 }, { "name": "其他", "code": 837 }], [{ "name": "保健/美容/美发/健身", "code": 2050000 }, { "name": "健身/美体/舞蹈教练", "code": 376 }, { "name": "美发/发型师", "code": 377 }, { "name": "救生员", "code": 638 }, { "name": "美容师/美甲师", "code": 639 }, { "name": "化妆师", "code": 640 }, { "name": "按摩/足疗", "code": 641 }, { "name": "美容顾问(BA)", "code": 802 }, { "name": "美发培训师", "code": 2084 }, { "name": "游泳教练", "code": 2085 }, { "name": "高尔夫教练", "code": 2086 }, { "name": "瑜伽教练", "code": 2087 }, { "name": "户外/游戏教练", "code": 2088 }, { "name": "美体师", "code": 2089 }, { "name": "美容整形师", "code": 2090 }, { "name": "其他", "code": 234 }], [{ "name": "医院/医疗/护理", "code": 2051000 }, { "name": "医疗管理人员", "code": 228 }, { "name": "综合门诊/全科医生", "code": 229 }, { "name": "药房管理/药剂师", "code": 232 }, { "name": "心理医生", "code": 373 }, { "name": "化验/检验科医师", "code": 374 }, { "name": "针灸/推拿", "code": 375 }, { "name": "护士/护理人员", "code": 397 }, { "name": "内科医生", "code": 642 }, { "name": "外科医生", "code": 643 }, { "name": "儿科医生", "code": 644 }, { "name": "牙科医生", "code": 645 }, { "name": "中医科医生", "code": 646 }, { "name": "麻醉医生", "code": 647 }, { "name": "眼科医生/验光师", "code": 648 }, { "name": "营养师", "code": 649 }, { "name": "理疗师", "code": 804 }, { "name": "兽医", "code": 898 }, { "name": "美容整形科医生", "code": 899 }, { "name": "医学影像/放射科医师", "code": 900 }, { "name": "验光师", "code": 2091 }, { "name": "公共卫生/疾病监控", "code": 2092 }, { "name": "护理主任/护士长", "code": 2093 }, { "name": "院长", "code": 2094 }, { "name": "专科医生", "code": 2095 }, { "name": "其他", "code": 650 }], [{ "name": "旅游/度假/出入境服务", "code": 4040000 }, { "name": "导游/票务", "code": 282 }, { "name": "旅游顾问", "code": 530 }, { "name": "旅游计划调度", "code": 531 }, { "name": "旅游产品销售", "code": 799 }, { "name": "签证业务办理", "code": 800 }, { "name": "旅游产品/线路策划", "code": 897 }, { "name": "潜水员", "code": 2171 }, { "name": "海外游计调", "code": 2172 }, { "name": "水族馆表演演员", "code": 2173 }, { "name": "其他", "code": 283 }], [{ "name": "商超/酒店/娱乐管理/服务", "code": 5005000 }, { "name": "楼面管理", "code": 16 }, { "name": "店员/营业员/导购员", "code": 17 }, { "name": "促销员", "code": 173 }, { "name": "大堂经理/领班", "code": 276 }, { "name": "前厅接待/礼仪/迎宾", "code": 277 }, { "name": "服务员", "code": 279 }, { "name": "酒店管理", "code": 281 }, { "name": "收银员", "code": 354 }, { "name": "理货员", "code": 355 }, { "name": "防损员/内保", "code": 492 }, { "name": "品牌/连锁招商管理", "code": 493 }, { "name": "奢侈品销售", "code": 494 }, { "name": "品类管理", "code": 634 }, { "name": "客房管理", "code": 636 }, { "name": "主持人/司仪", "code": 637 }, { "name": "收银主管", "code": 794 }, { "name": "预订员", "code": 796 }, { "name": "行李员", "code": 798 }, { "name": "店长/卖场管理", "code": 895 }, { "name": "促销主管/督导", "code": 896 }, { "name": "客房服务员", "code": 2222 }, { "name": "生鲜食品加工/处理", "code": 2223 }, { "name": "酒店试睡员", "code": 2224 }, { "name": "门卫", "code": 2225 }, { "name": "质量管理", "code": 2226 }, { "name": "其他", "code": 357 }], [{ "name": "社区/居民/家政服务", "code": 6270000 }, { "name": "保安", "code": 104 }, { "name": "宠物护理和美容", "code": 233 }, { "name": "家政人员", "code": 308 }, { "name": "婚礼/庆典策划服务", "code": 611 }, { "name": "保洁", "code": 651 }, { "name": "保安经理", "code": 805 }, { "name": "搬运工", "code": 806 }, { "name": "保姆/母婴护理", "code": 901 }, { "name": "钟点工", "code": 2227 }, { "name": "月嫂", "code": 2228 }, { "name": "家电维修", "code": 2229 }, { "name": "其他", "code": 310 }]], [{ "name": "能源|环保|农业|科研" }, [{ "name": "农/林/牧/渔业", "code": 100000 }, { "name": "饲料销售", "code": 654 }, { "name": "动物育种/养殖", "code": 655 }, { "name": "农艺师", "code": 656 }, { "name": "畜牧师", "code": 657 }, { "name": "动物营养/饲料研发", "code": 913 }, { "name": "林业技术人员", "code": 914 }, { "name": "园艺师", "code": 915 }, { "name": "插花设计师", "code": 2000 }, { "name": "其他", "code": 264 }], [{ "name": "能源/矿产/地质勘查", "code": 130000 }, { "name": "石油/天然气技术人员", "code": 284 }, { "name": "空调/热能工程师", "code": 285 }, { "name": "电力工程师/技术员", "code": 286 }, { "name": "核力/火力工程师", "code": 290 }, { "name": "地质勘查/选矿/采矿", "code": 372 }, { "name": "能源/矿产项目管理", "code": 534 }, { "name": "水利/水电工程师", "code": 617 }, { "name": "电力系统研发工程师", "code": 2020 }, { "name": "电力电子研发工程师", "code": 2021 }, { "name": "控制保护研发工程师", "code": 2022 }, { "name": "其他", "code": 291 }], [{ "name": "公务员/事业单位/科研机构", "code": 200100 }, { "name": "科研人员", "code": 255 }, { "name": "公务员/事业单位人员", "code": 305 }, { "name": "科研管理人员", "code": 362 }, { "name": "其他", "code": 306 }], [{ "name": "环境科学/环保", "code": 2023100 }, { "name": "生态治理/规划", "code": 266 }, { "name": "环境管理/园林景区保护", "code": 379 }, { "name": "环保技术工程师", "code": 380 }, { "name": "水处理工程师", "code": 615 }, { "name": "环境评价工程师", "code": 616 }, { "name": "固废处理工程师", "code": 903 }, { "name": "废气处理工程师", "code": 904 }, { "name": "环境监测工程师", "code": 905 }, { "name": "其他", "code": 267 }]], [{ "name": "兼职|实习|社工|其他" }, [{ "name": "志愿者/社会工作者", "code": 200700 }, { "name": "志愿者/义工", "code": 658 }, { "name": "社会工作者/社工", "code": 838 }, { "name": "其他", "code": 839 }], [{ "name": "兼职/临时", "code": 300100 }, { "name": "临时", "code": 300 }, { "name": "兼职", "code": 659 }, { "name": "国外求职", "code": 2143 }, { "name": "其他", "code": 303 }], [{ "name": "其他", "code": 300200 }, { "name": "其他", "code": 304 }], [{ "name": "实习生/培训生/储备干部", "code": 5006000 }, { "name": "实习生", "code": 299 }, { "name": "储备干部", "code": 301 }, { "name": "培训生", "code": 302 }, { "name": "其他", "code": 381 }]]],


    industry_list: [[{ "name": "服务业" }, { "name": "医疗/护理/美容/保健/卫生服务", "code": 51 }, { "name": "酒店/餐饮", "code": 52 }, { "name": "旅游/度假", "code": 53 }], [{ "name": "IT|通信|电子|互联网" }, { "name": "互联网/电子商务", "code": 67 }, { "name": "计算机软件", "code": 1 }, { "name": "IT服务(系统/数据/维护)", "code": 2 }, { "name": "电子技术/半导体/集成电路", "code": 3 }, { "name": "计算机硬件", "code": 4 }, { "name": "通信/电信/网络设备", "code": 5 }, { "name": "通信/电信运营、增值服务", "code": 6 }, { "name": "网络游戏", "code": 7 }], [{ "name": "金融业" }, { "name": "基金/证券/期货/投资", "code": 8 }, { "name": "保险", "code": 9 }, { "name": "银行", "code": 11 }, { "name": "信托/担保/拍卖/典当", "code": 13 }], [{ "name": "贸易|批发|零售|租赁业" }, { "name": "快速消费品（食品/饮料/烟酒/日化）", "code": 31 }, { "name": "贸易/进出口", "code": 35 }, { "name": "零售/批发", "code": 36 }, { "name": "租赁服务", "code": 37 }], [{ "name": "文体教育|工艺美术" }, { "name": "教育/培训/院校", "code": 38 }, { "name": "礼品/玩具/工艺美术/收藏品/奢侈品", "code": 39 }], [{ "name": "生产|加工|制造" }, { "name": "汽车/摩托车", "code": 40 }, { "name": "大型设备/机电设备/重工业", "code": 41 }, { "name": "加工制造（原料加工/模具）", "code": 42 }, { "name": "仪器仪表及工业自动化", "code": 43 }, { "name": "印刷/包装/造纸", "code": 44 }, { "name": "办公用品及设备", "code": 45 }, { "name": "医药/生物工程", "code": 46 }, { "name": "医疗设备/器械", "code": 47 }, { "name": "航空/航天研究与制造", "code": 48 }], [{ "name": "房地产|建筑业" }, { "name": "房地产/建筑/建材/工程", "code": 15 }, { "name": "家居/室内设计/装饰装潢", "code": 17 }, { "name": "物业管理/商业中心", "code": 19 }], [{ "name": "商业服务" }, { "name": "专业服务/咨询(财会/法律/人力资源等)", "code": 21 }, { "name": "广告/会展/公关", "code": 23 }, { "name": "中介服务", "code": 25 }, { "name": "检验/检测/认证", "code": 27 }, { "name": "外包服务", "code": 29 }], [{ "name": "政府|非盈利机构" }, { "name": "政府/公共事业/非盈利机构", "code": 32 }, { "name": "学术/科研", "code": 61 }], [{ "name": "文化|传媒|娱乐|体育" }, { "name": "媒体/出版/影视/文化传播", "code": 54 }, { "name": "娱乐/体育/休闲", "code": 55 }], [{ "name": "农|林|牧|渔|其他" }, { "name": "农/林/牧/渔", "code": 62 }, { "name": "跨领域经营", "code": 63 }, { "name": "其他", "code": 65 }], [{ "name": "交通|运输|物流|仓储" }, { "name": "交通/运输", "code": 49 }, { "name": "物流/仓储", "code": 50 }], [{ "name": "能源|矿产|环保" }, { "name": "能源/矿产/采掘/冶炼", "code": 56 }, { "name": "石油/石化/化工", "code": 57 }, { "name": "电气/电力/水利", "code": 58 }, { "name": "环保", "code": 59 }]],


  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    wx.hideShareMenu()
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
    
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
    // 己选显示
    if (this.data.checkbox_list.length >0){
      console.log('是否显示')
      var len = this.data.checkbox_list.length
      if (len == 1) { 
        this.setData({
          checkbox_name_1: this.data.checkbox_list[0].name,
          checkbox_name_2: '',
          checkbox_name_3: '',
          checkbox_code_1: this.data.checkbox_list[0].code,
          checkbox_code_2: '',
          checkbox_code_3: '',
        })
      }
      if (len == 2) {
        this.setData({
          checkbox_name_1: this.data.checkbox_list[0].name,
          checkbox_name_2: this.data.checkbox_list[1].name,
          checkbox_name_3: '',

          checkbox_code_1: this.data.checkbox_list[0].code,
          checkbox_code_2: this.data.checkbox_list[1].code,
          checkbox_code_3: '',
        })
      }
      if (len == 3) {
        this.setData({
          checkbox_name_1: this.data.checkbox_list[0].name,
          checkbox_name_2: this.data.checkbox_list[1].name,
          checkbox_name_3: this.data.checkbox_list[2].name,


          checkbox_code_1: this.data.checkbox_list[0].code,
          checkbox_code_2: this.data.checkbox_list[1].code,
          checkbox_code_3: this.data.checkbox_list[2].code
        })
       }
      
      this.setData({
        is_select:true
      })
    }else{
      console.log('是否不显示')
      this.setData({
        is_select: false,
        checkbox_name_1: '',
        checkbox_name_2: '',
        checkbox_name_3: '',


        checkbox_code_1: '',
        checkbox_code_2: '',
        checkbox_code_3: ''
      })
    }



    // 行业选择器己选显示
    if (this.data.checkbox_list_s.length > 0) {
      console.log('是否显示')
      var len = this.data.checkbox_list_s.length
      if (len == 1) {
        this.setData({
          checkbox_name_1_s: this.data.checkbox_list_s[0].name,
          checkbox_name_2_s: '',
          checkbox_name_3_s: '',
          checkbox_code_1_s: this.data.checkbox_list_s[0].code,
          checkbox_code_2_s: '',
          checkbox_code_3_s: '',
        })
      }
      if (len == 2) {
        this.setData({
          checkbox_name_1_s: this.data.checkbox_list_s[0].name,
          checkbox_name_2_s: this.data.checkbox_list_s[1].name,
          checkbox_name_3_s: '',

          checkbox_code_1_s: this.data.checkbox_list_s[0].code,
          checkbox_code_2_s: this.data.checkbox_list_s[1].code,
          checkbox_code_3_s: '',
        })
      }
      if (len == 3) {
        this.setData({
          checkbox_name_1_s: this.data.checkbox_list_s[0].name,
          checkbox_name_2_s: this.data.checkbox_list_s[1].name,
          checkbox_name_3_s: this.data.checkbox_list_s[2].name,


          checkbox_code_1_s: this.data.checkbox_list_s[0].code,
          checkbox_code_2_s: this.data.checkbox_list_s[1].code,
          checkbox_code_3_s: this.data.checkbox_list_s[2].code
        })
      }

      this.setData({
        is_select_s: true
      })
    } else {
      console.log('是否不显示')
      this.setData({
        is_select_s: false,
        checkbox_name_1_s: '',
        checkbox_name_2_s: '',
        checkbox_name_3_s: '',


        checkbox_code_1_s: '',
        checkbox_code_2_s: '',
        checkbox_code_3_s: ''
      })
  }

  



  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
    
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
    
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
    
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
    
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
    
  },

  back: function () {
    wx.switchTab({
      url: '/pages/my_resume/my_resume',
    })
  },
  PickerChange:function(e) {
    console.log('期望月薪',e);
    this.setData({
      money_index: e.detail.value
    })
  },
  //现住地

  xianju: function (e) {
    console.log('期望城市', e.detail.value)
    this.setData({
      xianju: e.detail.value
    })
  },




  //职位选择器
  showModal(e) {
    console.log(111)
    this.setData({
      modalName: e.currentTarget.dataset.target
    })
  },
  hideModal(e) {
    console.log(222)
    this.setData({
      modalName: null,
      one_click: 1,

      
    })
  }, 


  // 点击一级类
  one_class:function(e){
    this.setData({
      one_class_name:e.currentTarget.dataset.class_name,
      one_click:2,
      one_class_index: e.currentTarget.dataset.class_index,
    })
    console.log(e,'点击一级类')
  },

  //点击二级类

  two_class: function (e) {
    this.setData({
      one_click: 3,
      two_class_name: e.currentTarget.dataset.class_name,
      
      two_class_index: e.currentTarget.dataset.class_index,
    })
    console.log(e, '点击2级类')
  },

  // 点击1级标签类名跳回上一类
  set_one_class_index:function(){
    this.setData({
      one_click:1,
      two_class_name:'请选择',
      // three_class_name:''
    })

  },

  //点击2级标签类名跳到上一类
  set_two_class_index:function(){
    this.setData({
      one_click: 2
    })
  },


  //点击方块
  select_checkbox:function(e){
    console.log('点击方框', e, this.data.checkbox_list.length)
    var is_ =false
    for(var i =0;i<this.data.checkbox_list.length;i++){
      if (this.data.checkbox_list[i].name==e.currentTarget.dataset.checkbox_dict.name){
        is_ = true
      }
    }

    if (this.data.checkbox_list.length<3){
    
      if (this.data.checkbox_list.length==0){
          console.log('列表是空的，添加字典')
          this.data.checkbox_list.push(e.currentTarget.dataset.checkbox_dict)
        
      }
      else{

        var index = -1

        // 遍历列表，如果发现有这个元素，则把index设为1
        for (var i = 0; i < this.data.checkbox_list.length;i++){
          if (this.data.checkbox_list[i].name == e.currentTarget.dataset.checkbox_dict.name){
              index = 1
          }
        }
        console.log(index)
        // 判断是否在列表中 -1不在
        if(index==-1){
          console.log('列表不空，其中没有这个字典')
          this.data.checkbox_list.push(e.currentTarget.dataset.checkbox_dict)
          
        }else{
          console.log('列表不空，删除这个字典')

          for (var i = 0; i < this.data.checkbox_list.length; i++) {
            if (this.data.checkbox_list[i].name == e.currentTarget.dataset.checkbox_dict.name) {
              this.data.checkbox_list.splice(i, 1)
            }
          }


        }


      }
      console.log('checkbox_list列表------',this.data.checkbox_list)
  
    }else{
      if(is_){
        for (var i = 0; i < this.data.checkbox_list.length; i++) {
          if (this.data.checkbox_list[i].name == e.currentTarget.dataset.checkbox_dict.name) {
            this.data.checkbox_list.splice(i, 1)
          }
        }
      }else{
        wx.showToast({
          title: '最多选择三个标签',
          icon: 'none',
          duration: 1000
        })
      }


     
    }
    this.onShow()

    console.log('c22222222222', this.data.checkbox_list)
  },

  // 点击标签,删除标签
  cancel_checkbox:function(e){

    this.setData({
      
      
    })

    console.log('点击标签', e, this.data.checkbox_list.length)
    this.data.checkbox_list.splice(e.currentTarget.dataset.id, 1)

    // for (var i = 0; i < this.data.checkbox_list.length; i++) {
    //   if (this.data.checkbox_list[i].name == e.currentTarget.dataset.id) {
    //     this.data.checkbox_list.splice(i, 1)
    //   }
    // }

    this.onShow()


  },
  checkboxChange: function (e) {
      console.log('checkbox发生change事件，携带value值为：', e.detail.value)

  },
  back: function () {
    wx.navigateBack({

    })
  },

  









  // 行业选择器
  showModal_s(e) {
    console.log(333)
    this.setData({
      modalName_s: e.currentTarget.dataset.target
    })
  },
  hideModal_s(e) {
    console.log(444)
    this.setData({
      modalName_s: null,
      one_click_s: 1,

    })
  },


  // 点击一级类
  one_class_s: function (e) {
    this.setData({
      one_class_name_s: e.currentTarget.dataset.class_name,
      one_click_s: 2,
      one_class_index_s: e.currentTarget.dataset.class_index,
    })
    console.log(e, '点击一级类')
  },

  //点击二级类

  two_class_s: function (e) {
    this.setData({
      one_click_s: 3,
      two_class_name_s: e.currentTarget.dataset.class_name,

      two_class_index_s: e.currentTarget.dataset.class_index,
    })
    console.log(e, '点击2级类')
  },

  // 点击1级标签类名跳回上一类
  set_one_class_index_s: function () {
    this.setData({
      one_click_s: 1,
      two_class_name_s: '请选择',
      // three_class_name:''
    })

  },

  //点击2级标签类名跳到上一类
  set_two_class_index_s: function () {
    this.setData({
      one_click_s: 2
    })
  },


  //点击方块
  select_checkbox_s: function (e) {
    console.log('点击方框', e, this.data.checkbox_list_s.length)
    var is_ = false
    for (var i = 0; i < this.data.checkbox_list_s.length; i++) {
      if (this.data.checkbox_list_s[i].name == e.currentTarget.dataset.checkbox_dict.name) {
        is_ = true
      }
    }

    if (this.data.checkbox_list_s.length < 3) {

      if (this.data.checkbox_list_s.length == 0) {
        console.log('列表是空的，添加字典')
        this.data.checkbox_list_s.push(e.currentTarget.dataset.checkbox_dict)

      }
      else {

        var index = -1

        // 遍历列表，如果发现有这个元素，则把index设为1
        for (var i = 0; i < this.data.checkbox_list_s.length; i++) {
          if (this.data.checkbox_list_s[i].name == e.currentTarget.dataset.checkbox_dict.name) {
            index = 1
          }
        }
        console.log(index)
        // 判断是否在列表中 -1不在
        if (index == -1) {
          console.log('列表不空，其中没有这个字典')
          this.data.checkbox_list_s.push(e.currentTarget.dataset.checkbox_dict)

        } else {
          console.log('列表不空，删除这个字典')

          for (var i = 0; i < this.data.checkbox_list_s.length; i++) {
            if (this.data.checkbox_list_s[i].name == e.currentTarget.dataset.checkbox_dict.name) {
              this.data.checkbox_list_s.splice(i, 1)
            }
          }


        }


      }
      console.log('checkbox_list列表------', this.data.checkbox_list_s)

    } else {
      if (is_) {
        for (var i = 0; i < this.data.checkbox_list_s.length; i++) {
          if (this.data.checkbox_list_s[i].name == e.currentTarget.dataset.checkbox_dict.name) {
            this.data.checkbox_list_s.splice(i, 1)
          }
        }
      } else {
        wx.showToast({
          title: '最多选择三个标签',
          icon: 'none',
          duration: 1000
        })
      }



    }
    this.onShow()

    console.log('cxxxxxxxxxxxxxx', this.data.checkbox_list_s)
  },

  // 点击标签,删除标签
  cancel_checkbox_s: function (e) {
      
    this.setData({


    })

    console.log('点击标签11', e, this.data.checkbox_list_s.length)
    this.data.checkbox_list_s.splice(e.currentTarget.dataset.id, 1)

    // for (var i = 0; i < this.data.checkbox_list.length; i++) {
    //   if (this.data.checkbox_list[i].name == e.currentTarget.dataset.id) {
    //     this.data.checkbox_list.splice(i, 1)
    //   }
    // }

    this.onShow()


  },

  save:function(){

    
    if(this.data.checkbox_list!=0&this.data.checkbox_list_s!=0){
      



      console.log('期望月薪', this.data.money_index)
      console.log("期望城市", this.data.xianju)
      console.log('职位类别', this.data.checkbox_list)
      console.log('行业类别', this.data.checkbox_list_s)


      wx.setStorageSync('salary', this.data.money_index)
      wx.setStorageSync('need_place_id', this.data.xianju)
      wx.setStorageSync('position_id', this.data.checkbox_list)
      wx.setStorageSync('industry_id', this.data.checkbox_list_s)

    
    
      wx.navigateTo({
        url: '/pages/work_exp/work_exp',
      })
      
    }else{
      wx.showToast({
        title: '请填写完整信息',
        icon: 'none',
        duration: 1000
      }) 
     
    }



  },
  back:function(){
    wx.navigateBack({
      
    })
  }
















})